installHOWTO.tex
% Created 2012-07-02 Mon 07:33
\documentclass[10pt,english]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[paperwidth=8.5in,paperheight=11in]{geometry}
\geometry{verbose,tmargin=0.5in,bmargin=1in,lmargin=1in,rmargin=1in}
\providecommand{\alert}[1]{\textbf{#1}}

\title{HOWTO Install Software for STAT 5848/6948 at Home}
%\author{G. Jay Kerns}
\date{\vspace{-0.5in}Summer 2012}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.02}}

\begin{document}

\maketitle

\thispagestyle{empty}

\section*{You need \texttt{R}}
\label{sec-1}

The best thing I know to tell you is to use the install instructions I've written for \texttt{IPSUR} (a separate project, but it might be of some use to you).  You can find the instructions here:
\begin{center}
\href{http://ipsur.org/install.html}{ \texttt{http://ipsur.org/install.html} }
\end{center}

It's your best bet to install \texttt{R} in the default place.
\section*{You need \LaTeX}
\label{sec-2}

In order to write statistical reports with \texttt{R} you are going to need a \(\LaTeX\) distribution.  If you are running Microsoft Windows then your best bet is to go with MikTeX which you can find here:
\begin{center}
\href{http://miktex.org}{ \texttt{http://miktex.org} }
\end{center}

You will want to Download and install the latest version (2.9), though older versions will probably work if you have them.  It is probably alright to stick with the ``Basic Installer'', if nothing else, because the complete installation has a lengthy download time.
\section*{You need \texttt{RStudio}}
\label{sec-3}

Note for this step that you must have installed \texttt{R} version 2.11.1 or later.  Go here to download and install \texttt{RStudio}:
\begin{center}
\href{http://www.rstudio.org/}{ \texttt{http://www.rstudio.org/} }
\end{center}

You want the \emph{Desktop} version, and again, you are best to install in the default place.
\section*{Getting everybody to play together nicely}
\label{sec-4}

You don't actually need \(\LaTeX\) unless you are going to work on your \texttt{Sweave} reports at home.  I am guessing that you will want to at least try it out, but I'll admit to you that getting everybody to play together nicely is the hardest part of the process.  I'm saying this here because if for some reason you \emph{cannot} get everybody playing together then you can forego the \(\LaTeX\) part, get your script working the way you want it to at home, then come to YSU to write your report.

The most important thing is to install software in the default place in the right order so that it's easier for later parts to \emph{find} the parts earlier installed.  In the Lincoln 414 lab everything is in the right place and working so no additional work is needed.

One of the problems that has come up in previous years (depending on your system) is that sometimes the computer will complain \texttt{ERROR: Sweave.sty is not found}.  If this happens to you, then download the following file, \texttt{Sweave.sty}, from here:
\begin{center}
\href{http://www.cepe.ethz.ch/education/NPecoHS2010/Sweave.sty}{ \texttt{http://www.cepe.ethz.ch/education/NPecoHS2010/Sweave.sty} }
\end{center}

and save it in the same place where you have your report \texttt{.Rnw} file saved.  Then add the line

\begin{verbatim}
 \usepackage{Sweave}
\end{verbatim}

to the Preamble of the \texttt{.Rnw} file (somewhere above the line \texttt{\textbackslash{}begin\{document\}}).

\end{document}